// 特性 → 対象ポケモン
// GameWithの「特性一覧」を参考に、必要な分から追加していく
const abilityToPokemonData = {
  "アイスボディ": [
    "オニゴーリ",
    "グレイシア",
    "バイバニラ",
    "クレベース",
    "ヒスイクレベース",
    "バリコオル"
  ],

  "あくしゅう": [
    "ダストダス"
  ],

  "あついしぼう": [
    "メガフシギバナ",
    "カビゴン",
    "マリルリ",
    "マンムー",
    "タルップル"
  ],

  "あとだし": [
    "ヤミラミ"
  ],

  "アナライズ": [
    "スターミー",
    "ミルホッグ"
  ],

  "あまのじゃく": [
    "メガムクホーク",
    "ジャローダ",
    "カラマネロ",
    "メガカラマネロ"
  ],

  "あめうけざら": [
    "カメックス",
    "ペリッパー"
  ],

  "あめふらし": [
    "ニョロトノ",
    "ペリッパー"
  ],

  "アロマベール": [
    "フレフワン",
    "マホイップ"
  ],

  "いかく": [
    "アーボック",
    "ウインディ",
    "ヒスイウインディ",
    "ケンタロス",
    "ギャラドス",
    "ハリーセン",
    "クチート",
    "メガライボルト",
    "ムクホーク",
    "レントラー",
    "ワルビアル",
    "ズルズキン",
    "メガズルズキン",
    "ガオガエン",
    "アヤシシ",
    "ハリーマン",
    "パルデアケンタロス(かくとう)",
    "パルデアケンタロス(みず)",
    "パルデアケンタロス(ほのお)"
  ],

  "いしあたま": [
    "ヒスイウインディ",
    "プテラ",
    "ハガネール",
    "ボスゴドラ",
    "ガチゴラス"
  ],

  "いたずらごころ": [
    "ヤミラミ",
    "メガジュペッタ",
    "レパルダス",
    "エルフーン",
    "ニャオニクス(オス)",
    "クレッフィ",
    "オーロンゲ"

    
  ],

    "いやしのこころ": [
    "タブンネ",
    "メガタブンネ",
    "フレフワン",
    "ブリムオン"
  ],

  "イリュージョン": [
    "ゾロアーク",
    "ヒスイゾロアーク"
  ],

  "うるおいボディ": [
    "シャワーズ",
    "ヌメルゴン"
  ],

  "おみとおし": [
    "ヒスイバクフーン",
    "ジュペッタ",
    "オーロット",
    "パンプジン",
    "オンバーン",
    "オーロンゲ",
    "アヤシシ",
    "クエスパトラ"
  ],

  "おやこあい": [
    "メガガルーラ"
  ],

  "かいりきバサミ": [
    "カイロス",
    "クチート",
    "グライオン",
    "ケケンカニ"
  ],

  "かげふみ": [
    "メガゲンガー"
  ],

  "かそく": [
    "バシャーモ",
    "メガバシャーモ",
    "サメハダー",
    "ペンドラー",
    "クエスパトラ"
  ],

  "かたいツメ": [
    "メガリザードンX",
    "メガプテラ",
    "メガメタグロス",
    "ガメノデス",
    "メガガメノデス",
    "ルガルガン(たそがれ)"
  ],

  "かたやぶり": [
    "カイロス",
    "メガギャラドス",
    "メガデンリュウ",
    "ラムパルド",
    "メガエンブオー",
    "ドリュウズ",
    "ゴロンダ",
    "ルチャブル",
    "イダイトウ(オス)",
    "イダイトウ(メス)",
    "デカヌチャン"
  ],

  "かちき": [
    "ミロカロス",
    "エンペルト",
    "ニャオニクス(メス)"
  ],

  "カブトアーマー": [
    "タイレーツ"
  ],

  "かるわざ": [
    "ジュカイン",
    "レパルダス",
    "ペロリーム",
    "ルチャブル",
    "オオニューラ"
  ],

  "かわりもの": [
    "メタモン"
  ],

  "がんじょう": [
    "フォレトス",
    "ハガネール",
    "エアームド",
    "ボスゴドラ",
    "トリデプス",
    "クレベース",
    "ヒスイクレベース",
    "キョジオーン",
    "ブリジュラス"
  ],

  "がんじょうあご": [
    "メガサメハダー",
    "ガチゴラス",
    "ヒスイクレベース"
  ],

  "かんそうはだ": [
    "ドクロッグ",
    "エレザード"
  ],

  "きけんよち": [
    "ドクロッグ",
    "ブリムオン"
  ],

  "きもったま": [
    "ガルーラ",
    "メガミミロップ",
    "ゴロンダ",
    "ヒスイジュナイパー"
  ],

  "きゅうばん": [
    "カラマネロ"
  ],

  "きょううん": [
    "アブソル"
  ],

  "きょうせい": [
    "フラエッテ(えいえんのはな)",
    "フラージェス",
    "ヤレユータン"
  ],

  "きんちょうかん": [
    "アーボック",
    "プテラ",
    "ヘルガー",
    "バンギラス",
    "カエンジシ",
    "アーマーガア"
  ],

  "くいしんぼう": [
    "ウツボット",
    "カビゴン",
    "ヤナッキー",
    "バオッキー",
    "ヒヤッキー",
    "アップリュー",
    "タルップル"
  ],

  "くだけるよろい": [
    "エアームド",
    "ダストダス",
    "バイバニラ",
    "ポットデス",
    "グレンアルマ",
    "ソウブレイズ"
  ],

  "クリアボディ": [
    "メタグロス",
    "ドラパルト",
    "キョジオーン"
  ],

  "げきりゅう": [
    "カメックス",
    "オーダイル",
    "ラグラージ",
    "エンペルト",
    "ダイケンキ",
    "ヒスイダイケンキ",
    "ヒヤッキー",
    "ゲッコウガ",
    "アシレーヌ",
    "ウェーニバル"
  ],

  "こんじょう": [
    "カイリキー",
    "ブースター",
    "ヘラクロス",
    "レントラー",
    "ローブシン"
  ],

  "さいせいりょく": [
    "ヤドラン",
    "ガラルヤドラン",
    "ヤドキング",
    "ガラルヤドキング",
    "タブンネ",
    "ランクルス",
    "メガドラミドロ",
    "ドヒドイデ",
    "カミツオロチ"
  ],

  "サンパワー": [
    "リザードン",
    "メガヘルガー",
    "エレザード"
  ],

  "シェルアーマー": [
    "メガヤドラン",
    "コータス",
    "ドダイトス",
    "ダイケンキ",
    "メガペンドラー",
    "ヒスイヌメルゴン"
  ],

  "じしんかじょう": [
    "カイロス",
    "ギャラドス",
    "ヘラクロス",
    "ワルビアル",
    "ズルズキン",
    "カエンジシ",
    "ウェーニバル"
  ],

  "しぜんかいふく": [
    "スターミー",
    "チルタリス",
    "ロズレイド",
    "オーロット"
  ],

  "しめりけ": [
    "ニョロトノ",
    "ラグラージ",
    "ハラバリー"
  ],

  "しゅうかく": [
    "オーロット"
  ],

  "じゅうなん": [
    "メタモン",
    "ミミロップ",
    "レパルダス",
    "マッギョ",
    "ルチャブル",
    "ドヒドイデ"
  ],

  "しろいけむり": [
    "コータス"
  ],

  "シンクロ": [
    "フーディン",
    "エーフィ",
    "ブラッキー",
    "サーナイト",
    "ムシャーナ"
  ],

  "しんりょく": [
    "フシギバナ",
    "メガニウム",
    "ジュカイン",
    "ドダイトス",
    "ジャローダ",
    "ヤナッキー",
    "ブリガロン",
    "ジュナイパー",
    "ヒスイジュナイパー",
    "マスカーニャ"
  ],

  "スイートベール": [
    "ペロリーム",
    "アマージョ",
    "マホイップ"
  ],

  "すいすい": [
    "ハリーセン",
    "メガラグラージ",
    "ツンベアー",
    "イダイトウ(オス)",
    "イダイトウ(メス)",
    "ハリーマン"
  ],

  "スカイスキン": [
    "メガカイロス"
  ],

  "スキルリンク": [
    "メガヘラクロス",
    "ドデカバシ"
  ],

  "すてみ": [
    "ムクホーク",
    "ドサイドン",
    "エンブオー"
  ],

  "スナイパー": [
    "スピアー",
    "アリアドス",
    "ガメノデス"
  ],

  "すなおこし": [
    "バンギラス",
    "メガバンギラス",
    "カバルドン"
  ],

  "すなかき": [
    "ドリュウズ",
    "ルガルガン(まひる)",
    "ハカドッグ"
  ],

  "すながくれ": [
    "ガブリアス",
    "グライオン",
    "マッギョ",
    "エレザード",
    "サダイジャ",
    "ミミズズ"
  ],

  "すなのちから": [
    "メガハガネール",
    "メガガブリアス",
    "カバルドン",
    "ドリュウズ"
  ],

  "すりぬけ": [
    "ミカルゲ",
    "エルフーン",
    "シャンデラ",
    "メガシャンデラ",
    "ニャオニクス(オス)",
    "ニャオニクス(メス)",
    "カラマネロ",
    "オンバーン",
    "ドラパルト"
  ],

  "するどいめ": [
    "ピジョット",
    "エアームド",
    "ペリッパー",
    "ヤミラミ",
    "ミルホッグ",
    "ニャオニクス(オス)",
    "ニャオニクス(メス)",
    "ドデカバシ",
    "ルガルガン(まひる)",
    "ルガルガン(まよなか)"
  ],

  "せいぎのこころ": [
    "ウインディ",
    "アブソル",
    "ルカリオ",
    "エルレイド"
  ],

  "せいしんりょく": [
    "フーディン",
    "ガルーラ",
    "カイリュー",
    "ブラッキー",
    "オニゴーリ",
    "ルカリオ",
    "メガエルレイド",
    "バンバドロ",
    "ヤレユータン",
    "コノヨザル"
  ],

  "せいでんき": [
    "ピカチュウ",
    "ライチュウ",
    "デンリュウ",
    "ライボルト",
    "エモンガ",
    "マッギョ",
    "ハラバリー"
  ],

  "そうしょく": [
    "マリルリ",
    "ヌメルゴン",
    "ヒスイヌメルゴン",
    "ジジーロン",
    "アヤシシ",
    "リキキリン"
  ],

  "たいねつ": [
    "ヤバソチャ"
  ],

  "だっぴ": [
    "アーボック",
    "ズルズキン",
    "サダイジャ"
  ],

  "ちからずく": [
    "ケンタロス",
    "オーダイル",
    "ハガネール",
    "クチート",
    "メガバクーダ",
    "ラムパルド",
    "ローブシン",
    "ドデカバシ",
    "バサギリ"
  ],

  "ちからもち": [
    "メガスターミー",
    "マリルリ",
    "メガクチート",
    "ホルード"
  ],

  "ちくでん": [
    "サンダース"
  ],

  "ちどりあし": [
    "ピジョット",
    "バリコオル"
  ],

  "ちょすい": [
    "シャワーズ",
    "ニョロトノ",
    "オニシズクモ"
  ],

  "てきおうりょく": [
    "メガスピアー",
    "メガルカリオ",
    "ドラミドロ",
    "イダイトウ(オス)",
    "イダイトウ(メス)",
    "メガキラフロル"
  ],

  "テクニシャン": [
    "ハッサム",
    "メガハッサム",
    "ロズレイド",
    "イッカネズミ"
  ],

  "てつのこぶし": [
    "ゴウカザル",
    "ローブシン",
    "ゴルーグ",
    "ゴロンダ",
    "ケケンカニ",
    "メガケケンカニ"
  ],

  "テレパシー": [
    "サーナイト",
    "チャーレム",
    "ムシャーナ",
    "オンバーン",
    "ヤレユータン"
  ],

  "てんきや": [
    "ポワルン"
  ],

  "てんねん": [
    "ピクシー",
    "ラウドボーン"
  ],

  "とうそうしん": [
    "レントラー",
    "カエンジシ"
  ],

  "どくしゅ": [
    "ドクロッグ",
    "ドラミドロ",
    "オオニューラ"
  ],

  "どくのトゲ": [
    "ハリーセン",
    "ロズレイド",
    "ペンドラー",
    "ドラミドロ",
    "ハリーマン"
  ],

  "トレース": [
    "メガフーディン",
    "サーナイト",
    "メガニャオニクス(オス)",
    "メガニャオニクス(メス)"
  ],

  "どんかん": [
    "ヤドラン",
    "ヤドキング",
    "マンムー",
    "エンニュート"
  ],

  "ぬめぬめ": [
    "ヌメルゴン",
    "ヒスイヌメルゴン"
  ],

  "ねんちゃく": [
    "カミツオロチ"
  ],

  "ノーガード": [
    "メガピジョット",
    "メガライチュウY",
    "カイリキー",
    "ゴルーグ",
    "メガルチャブル",
    "ルガルガン(まよなか)"
  ],

  "ノーてんき": [
    "チルタリス",
    "ジジーロン"
  ],

  "のろわれボディ": [
    "ゲンガー",
    "ジュペッタ",
    "ユキメノコ",
    "ポットデス",
    "ドラパルト"
  ],

  "ハードロック": [
    "バクーダ",
    "ドサイドン"
  ],

  "はっこう": [
    "スターミー",
    "ミルホッグ"
  ],

  "はとむね": [
    "ピジョット"
  ],

  "バトルスイッチ": [
    "ギルガルド"
  ],

  "はやあし": [
    "サンダース"
  ],

  "はやおき": [
    "ガルーラ",
    "ヘルガー"
  ],

  "はりきり": [
    "アップリュー"
  ],

  "ひでり": [
    "メガリザードンY",
    "キュウコン",
    "コータス"
  ],

  "ひらいしん": [
    "ピカチュウ",
    "ライチュウ",
    "メガジュカイン",
    "ライボルト",
    "ドサイドン"
  ],

  "ファーコート": [
    "トリミアン"
  ],

  "フィルター": [
    "メガボスゴドラ"
  ],

  "フェアリーオーラ": [
    "メガフラエッテ"
  ],

  "フェアリースキン": [
    "メガサーナイト",
    "メガチルタリス",
    "ニンフィア"
  ],

  "ぶきよう": [
    "ミミロップ",
    "タブンネ",
    "ゴルーグ"
  ],

  "ふくがん": [
    "ビビヨン"
  ],

  "ふくつのこころ": [
    "カイリキー",
    "ルカリオ",
    "エルレイド",
    "ルガルガン(まひる)"
  ],

  "ふしぎなうろこ": [
    "ミロカロス"
  ],

  "ふみん": [
    "アリアドス",
    "ジュペッタ",
    "パンプジン",
    "スコヴィラン"
  ],

  "ふゆう": [
    "チリーン",
    "メガチリーン",
    "ロトム",
    "ヒートロトム",
    "ウォッシュロトム",
    "フロストロトム",
    "スピンロトム",
    "カットロトム",
    "シビルドン",
    "サザンドラ",
    "メガマフォクシー"
  ],

  "プラス": [
    "デンリュウ",
    "デデンネ"
  ],

  "フラワーベール": [
    "フラエッテ(えいえんのはな)",
    "フラージェス"
  ],

  "フリーズスキン": [
    "メガオニゴーリ",
    "アマルルガ"
  ],

  "プレッシャー": [
    "プテラ",
    "アブソル",
    "ミカルゲ",
    "マニューラ",
    "アーマーガア",
    "オオニューラ",
    "ドドゲザン"
  ],

  "フレンドガード": [
    "ビビヨン",
    "イッカネズミ"
  ],

  "ヘヴィメタル": [
    "ボスゴドラ"
  ],

  "へんげんじざい": [
    "ゲッコウガ",
    "メガゲッコウガ",
    "マスカーニャ"
  ],

  "ポイズンヒール": [
    "グライオン"
  ],

  "ぼうおん": [
    "トリデプス",
    "ユキノオー",
    "ジャラランガ"
  ],

  "ほうし": [
    "ラフレシア"
  ],

  "ぼうじん": [
    "フォレトス",
    "ランクルス",
    "ジャラランガ"
  ],

  "ぼうだん": [
    "ブリガロン",
    "メガブリガロン",
    "ジャラランガ"
  ],

  "ほおぶくろ": [
    "ホルード",
    "デデンネ",
    "イッカネズミ"
  ],

  "ほのおのからだ": [
    "シャンデラ",
    "ウルガモス",
    "ファイアロー"
  ],

  "マイナス": [
    "ライボルト"
  ],

  "マイペース": [
    "ヤドラン",
    "ガラルヤドラン",
    "ヤドキング",
    "ガラルヤドキング",
    "クレベース",
    "バンバドロ",
    "デカヌチャン"
  ],

  "マグマのよろい": [
    "バクーダ"
  ],

  "まけんき": [
    "ナゲツケサル",
    "タイレーツ",
    "メガタイレーツ",
    "コノヨザル",
    "ドドゲザン"
  ],

  "マジックガード": [
    "ピクシー",
    "フーディン",
    "ランクルス"
  ],

  "マジックミラー": [
    "メガピクシー",
    "エーフィ",
    "メガヤミラミ",
    "メガアブソル",
    "ブリムオン"
  ],

  "ミイラ": [
    "デスカーン"
  ],

  "むしのしらせ": [
    "スピアー",
    "アリアドス",
    "ハッサム",
    "ヘラクロス",
    "ペンドラー",
    "ウルガモス",
    "バサギリ"
  ],

  "ムラっけ": [
    "オニゴーリ",
    "スコヴィラン"
  ],

  "メガランチャー": [
    "メガカメックス",
    "ブロスター"
  ],

  "メロメロボディ": [
    "ピクシー",
    "ミロカロス",
    "ミミロップ",
    "ニンフィア"
  ],

  "めんえき": [
    "カビゴン"
  ],

  "もうか": [
    "リザードン",
    "バクフーン",
    "ヒスイバクフーン",
    "バシャーモ",
    "ゴウカザル",
    "エンブオー",
    "バオッキー",
    "マフォクシー",
    "ガオガエン",
    "ラウドボーン"
  ],

  "ものひろい": [
    "ホルード",
    "デデンネ",
    "パンプジン"
  ],

  "もらいび": [
    "キュウコン",
    "ウインディ",
    "ヒスイウインディ",
    "ブースター",
    "バクフーン",
    "ヘルガー",
    "シャンデラ",
    "グレンアルマ",
    "ソウブレイズ"
  ],

  "やるき": [
    "ルガルガン(まよなか)",
    "コノヨザル"
  ],

  "ゆうばく": [
    "ダストダス"
  ],

  "ゆきがくれ": [
    "アローラキュウコン",
    "グレイシア",
    "マンムー",
    "ユキメノコ",
    "ツンベアー"
  ],

  "ゆきふらし": [
    "アローラキュウコン",
    "ユキノオー",
    "メガユキノオー",
    "メガユキメノコ",
    "バイバニラ",
    "アマルルガ"
  ],

  "ようりょくそ": [
    "フシギバナ",
    "ラフレシア",
    "ウツボット",
    "リーフィア",
    "エルフーン",
    "スコヴィラン"
  ],

  "ヨガパワー": [
    "チャーレム",
    "メガチャーレム"
  ],

  "よちむ": [
    "ムシャーナ"
  ],

  "ライトメタル": [
    "ハッサム",
    "メタグロス"
  ],

  "リーフガード": [
    "メガニウム",
    "リーフィア",
    "アマージョ"
  ],

  "りんぷん": [
    "ビビヨン"
  ],

  "わるいてぐせ": [
    "マニューラ",
    "ガメノデス",
    "オーロンゲ",
    "デカヌチャン"
  ],

  "エレキメイカー": [
    "メガライチュウX"
  ],

  "ぎゃくじょう": [
    "ジジーロン",
    "メガジジーロン"
  ],

  "ふしょく": [
    "エンニュート",
    "キラフロル"
  ],

  "もふもふ": [
    "ハカドッグ"
  ],

  "ばけのかわ": [
    "ミミッキュ"
  ],

  "じきゅうりょく": [
    "バンバドロ",
    "ブリジュラス"
  ],

  "とびだすなかみ": [
    "メガウツボット"
  ],

  "サーフテール": [
    "アローラライチュウ"
  ],

  "レシーバー": [
    "ナゲツケサル"
  ],

  "じょおうのいげん": [
    "アマージョ"
  ],

  "ゆきかき": [
    "ツンベアー"
  ],

  "えんかく": [
    "ジュナイパー"
  ],

  "うるおいボイス": [
    "アシレーヌ"
  ],

  "ひとでなし": [
    "ドヒドイデ"
  ],

  "すいほう": [
    "オニシズクモ"
  ],

  "ミラーアーマー": [
    "アーマーガア"
  ],

  "すなはき": [
    "サダイジャ"
  ],

  "ぎたい": [
    "ガラルマッギョ"
  ],

  "じゅくせい": [
    "アップリュー",
    "タルップル"
  ],

  "さまようたましい": [
    "デスバーン"
  ],

  "バリアフリー": [
    "バリコオル"
  ],

  "はらぺこスイッチ": [
    "モルペコ"
  ],

  "すじがねいり": [
    "メガエアームド",
    "ブリジュラス"
  ],

  "ふかしのこぶし": [
    "メガゴルーグ"
  ],

  "クイックドロウ": [
    "ガラルヤドラン"
  ],

  "さめはだ": [
    "サメハダー",
    "ガブリアス"
  ],

  "でんきエンジン": [
    "エモンガ"
  ],

  "いかりのつぼ": [
    "ケンタロス",
    "バクーダ",
    "ワルビアル",
    "ケケンカニ",
    "パルデアケンタロス(かくとう)",
    "パルデアケンタロス(みず)",
    "パルデアケンタロス(ほのお)"
  ],

  "マルチスケイル": [
    "カイリュー",
    "メガカイリュー"
  ],

  "はやてのつばさ": [
    "ファイアロー"
  ],

  "マジシャン": [
    "マフォクシー",
    "クレッフィ"
  ],

  "きみょうなくすり": [
    "ガラルヤドキング"
  ],

  "テイルアーマー": [
    "リキキリン"
  ],

  "でんきにかえる": [
    "ハラバリー"
  ],

  "はんすう": [
    "リキキリン",
    "パルデアケンタロス(かくとう)",
    "パルデアケンタロス(みず)",
    "パルデアケンタロス(ほのお)"
  ],

  "どしょく": [
    "ミミズズ"
  ],

  "びんじょう": [
    "クエスパトラ"
  ],

  "マイティチェンジ": [
    "イルカマン"
  ],

  "おうごんのからだ": [
    "サーフゴー"
  ],

  "どくげしょう": [
    "キラフロル"
  ],

  "そうだいしょう": [
    "ドドゲザン"
  ],

  "きれあじ": [
    "エルレイド",
    "ヒスイダイケンキ",
    "バサギリ"
  ],

  "きよめのしお": [
    "キョジオーン"
  ],

  "かんろなミツ": [
    "カミツオロチ"
  ],

  "おもてなし": [
    "ヤバソチャ"
  ],

  "メガソーラー": [
    "メガメガニウム"
  ],

  "ドラゴンスキン": [
    "メガオーダイル"
  ],

  "かんつうドリル": [
    "メガドリュウズ"
  ],

  "とびだすハバネロ": [
    "メガスコヴィラン"
  ],

  "うなぎのぼり": [
    "メガシビルドン"
  ],

  "ほのおのたてがみ": [
    "メガカエンジシ"
  ]
};

// ポケモン → 特性 に自動変換
const pokemonAbilityData = {};

Object.entries(abilityToPokemonData).forEach(([abilityName, pokemonNames]) => {
  pokemonNames.forEach(pokemonName => {
    if (!pokemonAbilityData[pokemonName]) {
      pokemonAbilityData[pokemonName] = [];
    }

    if (!pokemonAbilityData[pokemonName].includes(abilityName)) {
      pokemonAbilityData[pokemonName].push(abilityName);
    }
  });
});